In [2]:
import numpy as np
import pandas as pd
import json
import requests
def ssql(sql):
    admin_token = '2cebeb5c7edac5ef0d7c5a640e69fc7d43bf2cd6a24ce43dfee3dd33662c0bab'
    url = 'http://sensor.wb-intra.com/api/sql/query?token=%s&project=production' % admin_token
    data = {'q': sql, 'format': 'json'}
    req = requests.post(url,data)
    req_dec = req.content.decode()
    try:
        req_json = json.loads('[' + req_dec.replace('\n', ',')[:-1] + ']')
        df_d_id = pd.DataFrame(req_json)
        return df_d_id
    except:
        print(req_dec)

In [3]:
df_A = ssql("""SELECT t2.date,
       t2.distinct_id,
       t2.duration
FROM
  (SELECT second_id
   FROM users
   WHERE reg_channelId IN ('114',
                           '130')
   GROUP BY 1) t1
JOIN
  (SELECT date, distinct_id,
                sum(duration/60000)AS duration
   FROM events
   WHERE event = 'gameOver'
     AND gameTypeId = 1800
     AND date BETWEEN '2020-10-19' AND CURRENT_DATE()
   GROUP BY 1,
            2)t2 ON t1.second_id = t2.distinct_id""")

In [4]:
df_B = ssql("""SELECT t2.date, t2.distinct_id,
                t2.duration
FROM
  (SELECT second_id
   FROM users
   WHERE reg_channelId IN ('131',
                           '122',
                           '113',
                           '111',
                           '127',
                           '112',
                           '125',
                           '116')
   GROUP BY 1) t1
JOIN
  (SELECT date, distinct_id,
                sum(duration/60000)AS duration
   FROM events
   WHERE event = 'gameOver'
     AND gameTypeId = 1800
     AND date BETWEEN '2020-10-19' AND CURRENT_DATE()
   GROUP BY 1,
            2)t2 ON t1.second_id = t2.distinct_id""")

In [5]:
df_A

             date  duration distinct_id
0      2020-10-23   187.098   117725141
1      2020-10-22    44.621   149809835
2      2020-10-23    24.699   149809835
3      2020-10-22    13.150   116800600
4      2020-10-23    19.472   115614450
...           ...       ...         ...
20124  2020-10-22    68.490   126617676
20125  2020-10-22    62.850   135735065
20126  2020-10-22    17.460   116551910
20127  2020-10-23    23.367   116551910
20128  2020-10-22     5.540   147520906

[20129 rows x 3 columns]

In [6]:
df_B

             date  duration distinct_id
0      2020-10-22    25.749   121569811
1      2020-10-21    78.490   121569811
2      2020-10-20    36.435   121569811
3      2020-10-20     9.884   145409967
4      2020-10-23    63.574   137662419
...           ...       ...         ...
34246  2020-10-20     9.798   148608129
34247  2020-10-21    18.916   148608129
34248  2020-10-22    43.307   139743387
34249  2020-10-23    35.130   139743387
34250  2020-10-22    10.901   126506841

[34251 rows x 3 columns]

In [37]:
list(df_B.date.unique())

['2020-10-22', '2020-10-21', '2020-10-20', '2020-10-23', '2020-10-19']

## 19号的游戏时长对比

### 单游戏形态

In [45]:
df_A[df_A['date'] == list(df_B.date.unique())[-1]].describe().T.to_clipboard()

### 玩吧形态

In [46]:
df_B[df_B['date'] == list(df_B.date.unique())[-1]].describe().T.to_clipboard()

## 20号的游戏时长对比

### 单游戏形态

In [47]:
df_A[df_A['date'] == list(df_B.date.unique())[2]].describe().T.to_clipboard()

### 玩吧形态

In [48]:
df_B[df_B['date'] == list(df_B.date.unique())[2]].describe().T.to_clipboard()

## 21号的游戏时长对比

### 单游戏形态

In [49]:
df_A[df_A['date'] == list(df_B.date.unique())[1]].describe().T.to_clipboard()

### 玩吧形态

In [50]:
df_B[df_B['date'] == list(df_B.date.unique())[1]].describe().T.to_clipboard()

## 22号的游戏时长对比

### 单游戏形态

In [51]:
df_A[df_A['date'] == list(df_B.date.unique())[0]].describe().T.to_clipboard()

### 玩吧形态

In [52]:
df_B[df_B['date'] == list(df_B.date.unique())[0]].describe().T.to_clipboard()